function [roznica2,alpha,alpha37_003_001]=model_ustroju_perf_fun(skala)

a=0.003*skala(1); %promien otworow
tp=12.5*10^(-3)*skala(2); %grubosc plyty
ta=0.038*skala(3); %grubosc welny hp=0.038
sigma = 25000*skala(4); % oporność przepływu wełny mineralnej



% wektor częstotliwości
f=[100,106,112,118,125,132,140,150,160,170,180,190,200,212,224,236,250,265,280,300,315,335,355,375,400,425,450,475,500,530,560,600,630,670,710,750,800,850,900,950,1000,1060,1120,1180,1250,1320,1400,1500,1600];
omega=2*pi.*f;
ro0=1.21;

n=37; %liczba otworow na krążku o średnicy 100 mm
% D = a*2 + 0.009; %odleglosc miedzy srodkami
epsilon= n*a^2/((0.05)^2); %udzial perforacji

c=343;
v=1.84*10^(-5);
if epsilon < 0.13
popr=0.8*(1-1.4*sqrt(epsilon));
end
if epsilon > 0.13
    popr = 0.85;
end

rm=(ro0/epsilon)*sqrt(8*v.*omega)*(1+tp/(2*a)); % oporność przepływu powietrza przez perforację
m=(ro0/epsilon)*(tp+2*popr*a+sqrt((8*v./omega)*(1+tp/(2*a)))); % masa powietrza w perforacji
psi=0;
model = 'Miki';
[zc1,kc1] = zk(model,sigma,f); %dla welny
z1w = -1i*zc1.*cot(kc1.*ta);
z3 = rm+1i*omega.*m+z1w;
R=(z3./(ro0*c)*cos(psi)-1)./(z3./(ro0*c)*cos(psi)+1); % współczynnik odbicia
alpha = 1 - (abs(R)).^2; % współczynnik pochłaniania
%% współczynnik pochłaniania dźwięku wełny z pomiarów
% odległość między krawędziami otworów 9 mm
% alpha37_003_009=[0.008306343,0.011739197,0.015461602,0.019470114,0.024506984,0.029930906,0.036603072,0.045653688,0.055495429,0.066131511,0.077566182,0.089804369,0.102851315,0.119582483,0.137493737,0.156591159,0.180374518,0.207649615,0.236763048,0.278378343,0.311609698,0.358436965,0.407857417,0.459454549,0.526181021,0.59414221,0.661753194,0.727233341,0.788720959,0.854720402,0.909740384,0.96294498,0.9868296,0.998168708,0.989089122,0.964088627,0.917659656,0.861879639,0.802794696,0.744367659,0.688910796,0.627865167,0.573412775,0.525421326,0.476906216,0.435451841,0.395387617,0.354259269,0.321028343];

% odległość między krawędziami otworów 1 mm
alpha37_003_001=[0.040316517,0.047702506,0.055613765,0.064047465,0.074544087,0.085744486,0.099399974,0.117737271,0.137460046,0.158536219,0.180924987,0.204575638,0.22942645,0.260727027,0.293497438,0.327558531,0.368650009,0.413884765,0.459860354,0.521324762,0.566759809,0.625283527,0.680167599,0.730146041,0.784170391,0.827562379,0.859735778,0.88084605,0.891652924,0.892695956,0.883040016,0.857830035,0.832600095,0.794046668,0.752874591,0.711366504,0.661161616,0.614231799,0.571240852,0.532328524,0.497353539,0.460185786,0.42771297,0.399354164,0.370750177,0.346254317,0.322470196,0.297927713,0.278059862];


roznica2=sum(abs(alpha37_003_001-alpha));
%%

% plot(f,alpha,'k')
% xtickangle(45);
% axis([100 1600 0 1])
% xlabel('Częstotliwość [Hz]');
% ylabel('Współczynnik pochłaniania dźwięku [-]');
% hold on;
% plot(f,alpha37_003_009,'r')
% plot(f,alpha37_003_001,'b')
% legend({'37 x 0.003 Model','37 x 0.003 - 0.009', '37 x 0.003 - 0.001'},'Location','northeast');